{"name":"Localization_Readme","type":"canonical_document","observations":["Project overview for ICTServe localization: scanning + extraction tools; translation conventions; email localization; tools/scripts in scripts/ (scanner + extractor) and sample usage; translation key naming pattern {filename}.{section}.{key}; recommends `php scripts/scan-hardcoded-strings.php` for scanning."]}
{"name":"Localization_Implementation_Summary","type":"canonical_document","observations":["Implementation details: scanning produced 4,139 hardcoded strings; created `lang/en` and `lang/ms` translation files; created `emails.php` (370+ keys) and updated other language files; scanning & extraction tools support bilingual format detection; results show top files needing localization and key naming conventions for email and admin keys."]}
{"name":"Localization_Final_Report","type":"canonical_document","observations":["Final report: Automated scanning + extraction completed; 1,572+ translation keys generated; email templates fully localized; output includes `localization-scan-results.json`; project branch and dates listed; statistics showing improved localization rates and progress metrics."]}
{"name":"Localization_Scan_Report","type":"canonical_document","observations":["Detailed scan results from the hardcoded string scanner: files scanned, stats (hardcoded strings, already localized strings), and a per-file breakdown. Output JSON file `localization-scan-results.json`."]}
{"name":"Before_And_After_Localization","type":"documentation","observations":["Before: bilingual inline strings (English / Malay) mixed in templates; After: replaced with translation keys using __(), with clear examples; benefits: dynamic switching, maintainability, scalability."]}
{"name":"Localization_Validation_Summary","type":"canonical_document","observations":["Validation details: PHP linter check for translation files; translation parity and structure verified; email template variable interpolation validated; no breaking changes; translation key naming conventions validated."]}
{"name":"Filament_4_Migration_Summary","type":"technical_implementation","observations":["Filament 3 → 4 migration results: change action namespaces to Filament\\Actions, layout components use Filament\\Schemas\\Components, default file visibility private, no 'all' pagination and deferFilters() default; lists files modified and verification steps."]}
{"name":"Filament_4_Verification_Report","type":"canonical_document","observations":["Verification across action namespaces, schema hints, relation managers, icons (Heroicon enum), deferred filters, tests updated to Filament 4 patterns; verified 11 resources and Filament tests usage; verification commands provided."]}
{"name":"Filament_4_Resolution_Summary","type":"documentation","observations":["Comprehensive fix summary for Filament 4.x test failures; steps and pattern to update resources; guidance for future migrations."]}
{"name":"CrossModule_Fix_Summary","type":"technical_implementation","observations":["Cross-module integration tests fixed by aligning Filament admin UI tests and verifying relationship assertions; replaced incorrect `assertSee` usage for cross-module data; added DB assertions and improved tests for relation managers and transaction history; details on tests updated and new patterns."]}
{"name":"Approval_Interface_Fix_Summary","type":"technical_implementation","observations":["Fixes for ApprovalInterfaceTest: Middleware updated to check both raw role attribute and Spatie roles; blade view variable mismatch fixed; expected tests now pass; run instructions included."]}
{"name":"Accessibility_Test_Complete_Summary","type":"canonical_document","observations":["WCAG 2.2 AA verification: 19/21 passing. Notable outstanding item: staff dashboard color contrast violation for .text-xs.text-slate-500 over dark backgrounds; recommendations (change color or size) and files to update given."]}
{"name":"Playwright_Test_Fixes","type":"technical_implementation","observations":["Playwright test fixes for URL mismatches, i18n text assertions, and route patterns; updated tests to match actual routes; improved dashboard i18n checks; several tests changed from English-only to bilingual dashboard|papan pemuka patterns."]}
{"name":"Referential_Integrity_Fix_Summary","type":"technical_implementation","observations":["SQLite test environment does not enforce FK constraints; tests rewritten to assert application-level referential integrity and soft-delete behavior; verified cascade and restrict on deletes semantics at application level."]}
{"name":"Test_Failure_Analysis","type":"documentation","observations":["Analysis of failing tests, categories (route naming mismatches, UI text mismatches, authorization issues, missing features); suggestions for fixes and next steps; guidance for CI and route alias choices."]}
{"name":"Test_Progress_Report","type":"documentation","observations":["Progress for `AuthenticatedPortalTest`: Phase 1 route updates complete; remaining failures: UI text mismatches and authorization issues; guidance for test skip handling and next steps."]}
{"name":"Test_Status_Update","type":"documentation","observations":["CrossModule Integration Tests: all passing after fixes; details about unit/feature/filament/integration test updates; summary of changes, benefits and results."]}
{"name":"Resolution_Summary","type":"documentation","observations":["High-level outcome for Filament tests resolution; migration tasks and verification checklist; instructions for future migration."]}
{"name":"Phase_3_Progress","type":"documentation","observations":["Phase 3 progress: System and Automated Report emails localized; security emails and scheduled reports remaining; translation files new `system.php` with 198 keys; next steps for livewire component localization."]}
